# ResList_ActFolder

## Description
Set a filter to show only symbols form a particular symbol folder in the active file. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_ActFolder(
				uniqueID : STRING;
				folder   : STRING);
```

```python
def vs.ResList_ActFolder(uniqueID, folder):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |
|folder|STRING|   |

## Version
Availability: from Vectorworks 2019.3

## Category
* Document List Handling